Autodesk.Revit.DB.FilterableValueProvider.GetAssociatedGlobalParameterValue(Autodesk.Revit.DB.Element)
Gets a global parameter value associated with a parameter from the given element.
element:
The element to query.
Returns:
The associated global parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilterableValueProvider.IsElementIdValueSupported(Autodesk.Revit.DB.Element)
Determines whether the provide can provide an ElementId value for the given element.
element:
The element to query.
Returns:
True if the provider can return an ElementId value for the given element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilterableValueProvider.GetElementIdValue(Autodesk.Revit.DB.Element)
Gets an ElementId value from the given element.
element:
The element to query.
Returns:
The ElementId value from the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilterableValueProvider.IsIntegerValueSupported(Autodesk.Revit.DB.Element)
Determines whether the provide can provide an integer value for the given element.
element:
The element to query.
Returns:
True if the provider can return an integer value for the given element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilterableValueProvider.GetIntegerValue(Autodesk.Revit.DB.Element)
Gets an integer value from the given element.
element:
The element to query.
Returns:
The integer value from the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilterableValueProvider.IsDoubleValueSupported(Autodesk.Revit.DB.Element)
Determines whether the provide can provide a double-precision numeric value for the given element.
element:
The element to query.
Returns:
True if the provider can return a double-precision numeric value for the given element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilterableValueProvider.GetDoubleValue(Autodesk.Revit.DB.Element)
Gets a double-precision numeric value from the given element.
element:
The element to query.
Returns:
The double-precision numeric value from the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilterableValueProvider.IsStringValueSupported(Autodesk.Revit.DB.Element)
Determines whether the provide can provide a string value for the given element.
element:
The element to query.
Returns:
True if the provider can return a string value for the given element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilterableValueProvider.GetStringValue(Autodesk.Revit.DB.Element)
Gets a string value from the given element.
element:
The element to query.
Returns:
The string value from the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011